Revit 2026 API

# VertexPositionNormalColoredSetColor Method

---

Sets the vertex's color.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetColor(
	ColorWithTransparency color
)
```
```vb
Public Sub SetColor (
	color As ColorWithTransparency
)
```
```cpp
public:
void SetColor(
	ColorWithTransparency^ color
)
```
```fsharp
member SetColor :
        color : ColorWithTransparency -> unit
```

#### Parameters

color ColorWithTransparency
     The vertex's color.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

VertexPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace